perf/stress_testing/results/quote_results.txt

> perf@1.0.0 artillery
> artillery run stress_testing/quote.yaml -e app

Phase started: WarmUp (index: 0, duration: 30s) 14:24:26(-0300)

--------------------------------------
Metrics for period to: 14:24:30(-0300) (width: 3.041s)
--------------------------------------

http.codes.200: ................................................................ 15
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 17
http.response_time:
  min: ......................................................................... 490
  max: ......................................................................... 1072
  median: ...................................................................... 1002.4
  p95: ......................................................................... 1064.4
  p99: ......................................................................... 1064.4
http.responses: ................................................................ 15
vusers.completed: .............................................................. 15
vusers.created: ................................................................ 17
vusers.created_by_name.quote (/quote): ......................................... 17
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 495.2
  max: ......................................................................... 1092.9
  median: ...................................................................... 1043.3
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1085.9


--------------------------------------
Metrics for period to: 14:24:40(-0300) (width: 9.54s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 487
  max: ......................................................................... 987
  median: ...................................................................... 518.1
  p95: ......................................................................... 550.1
  p99: ......................................................................... 561.2
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.quote (/quote): ......................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 490.8
  max: ......................................................................... 990
  median: ...................................................................... 528.6
  p95: ......................................................................... 561.2
  p99: ......................................................................... 584.2


Phase completed: WarmUp (index: 0, duration: 30s) 14:24:56(-0300)

Phase started: Ramp (index: 1, duration: 30s) 14:24:56(-0300)

--------------------------------------
Metrics for period to: 14:24:50(-0300) (width: 9.52s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 485
  max: ......................................................................... 1047
  median: ...................................................................... 518.1
  p95: ......................................................................... 550.1
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.quote (/quote): ......................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 490.7
  max: ......................................................................... 1048.8
  median: ...................................................................... 528.6
  p95: ......................................................................... 561.2
  p99: ......................................................................... 1022.7


--------------------------------------
Metrics for period to: 14:25:00(-0300) (width: 9.696s)
--------------------------------------

http.codes.200: ................................................................ 52
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 55
http.response_time:
  min: ......................................................................... 491
  max: ......................................................................... 1126
  median: ...................................................................... 518.1
  p95: ......................................................................... 584.2
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 52
vusers.completed: .............................................................. 52
vusers.created: ................................................................ 55
vusers.created_by_name.quote (/quote): ......................................... 55
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 493.1
  max: ......................................................................... 1128.6
  median: ...................................................................... 518.1
  p95: ......................................................................... 584.2
  p99: ......................................................................... 1022.7


--------------------------------------
Metrics for period to: 14:25:10(-0300) (width: 9.904s)
--------------------------------------

http.codes.200: ................................................................ 152
http.request_rate: ............................................................. 16/sec
http.requests: ................................................................. 159
http.response_time:
  min: ......................................................................... 488
  max: ......................................................................... 1120
  median: ...................................................................... 518.1
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 152
vusers.completed: .............................................................. 152
vusers.created: ................................................................ 159
vusers.created_by_name.quote (/quote): ......................................... 159
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 490.7
  max: ......................................................................... 1122.3
  median: ...................................................................... 528.6
  p95: ......................................................................... 1022.7
  p99: ......................................................................... 1043.3


Phase completed: Ramp (index: 1, duration: 30s) 14:25:26(-0300)

Phase started: Plain (index: 2, duration: 60s) 14:25:26(-0300)

--------------------------------------
Metrics for period to: 14:25:20(-0300) (width: 9.884s)
--------------------------------------

http.codes.200: ................................................................ 254
http.request_rate: ............................................................. 26/sec
http.requests: ................................................................. 257
http.response_time:
  min: ......................................................................... 485
  max: ......................................................................... 1057
  median: ...................................................................... 518.1
  p95: ......................................................................... 572.6
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 254
vusers.completed: .............................................................. 254
vusers.created: ................................................................ 257
vusers.created_by_name.quote (/quote): ......................................... 257
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 487
  max: ......................................................................... 1062.2
  median: ...................................................................... 528.6
  p95: ......................................................................... 584.2
  p99: ......................................................................... 1043.3


--------------------------------------
Metrics for period to: 14:25:30(-0300) (width: 9.966s)
--------------------------------------

http.codes.200: ................................................................ 364
http.request_rate: ............................................................. 38/sec
http.requests: ................................................................. 369
http.response_time:
  min: ......................................................................... 483
  max: ......................................................................... 1093
  median: ...................................................................... 518.1
  p95: ......................................................................... 620.3
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 364
vusers.completed: .............................................................. 364
vusers.created: ................................................................ 369
vusers.created_by_name.quote (/quote): ......................................... 369
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 484.9
  max: ......................................................................... 1107.6
  median: ...................................................................... 528.6
  p95: ......................................................................... 620.3
  p99: ......................................................................... 1043.3


--------------------------------------
Metrics for period to: 14:25:40(-0300) (width: 9.976s)
--------------------------------------

http.codes.200: ................................................................ 400
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 480
  max: ......................................................................... 1037
  median: ...................................................................... 518.1
  p95: ......................................................................... 572.6
  p99: ......................................................................... 620.3
http.responses: ................................................................ 400
vusers.completed: .............................................................. 400
vusers.created: ................................................................ 400
vusers.created_by_name.quote (/quote): ......................................... 400
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 482.7
  max: ......................................................................... 1040.1
  median: ...................................................................... 518.1
  p95: ......................................................................... 584.2
  p99: ......................................................................... 645.6


--------------------------------------
Metrics for period to: 14:25:50(-0300) (width: 9.958s)
--------------------------------------

http.codes.200: ................................................................ 399
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 488
  max: ......................................................................... 1627
  median: ...................................................................... 528.6
  p95: ......................................................................... 820.7
  p99: ......................................................................... 1465.9
http.responses: ................................................................ 399
vusers.completed: .............................................................. 399
vusers.created: ................................................................ 400
vusers.created_by_name.quote (/quote): ......................................... 400
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 490.9
  max: ......................................................................... 1638.2
  median: ...................................................................... 539.2
  p95: ......................................................................... 820.7
  p99: ......................................................................... 1465.9


--------------------------------------
Metrics for period to: 14:26:00(-0300) (width: 9.973s)
--------------------------------------

http.codes.200: ................................................................ 401
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 483
  max: ......................................................................... 1108
  median: ...................................................................... 528.6
  p95: ......................................................................... 620.3
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 401
vusers.completed: .............................................................. 401
vusers.created: ................................................................ 400
vusers.created_by_name.quote (/quote): ......................................... 400
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 485.6
  max: ......................................................................... 1111.3
  median: ...................................................................... 528.6
  p95: ......................................................................... 632.8
  p99: ......................................................................... 1043.3


--------------------------------------
Metrics for period to: 14:26:10(-0300) (width: 9.986s)
--------------------------------------

http.codes.200: ................................................................ 401
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 486
  max: ......................................................................... 1056
  median: ...................................................................... 518.1
  p95: ......................................................................... 539.2
  p99: ......................................................................... 561.2
http.responses: ................................................................ 401
vusers.completed: .............................................................. 401
vusers.created: ................................................................ 400
vusers.created_by_name.quote (/quote): ......................................... 400
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 489.3
  max: ......................................................................... 1065.6
  median: ...................................................................... 518.1
  p95: ......................................................................... 550.1
  p99: ......................................................................... 561.2


Phase completed: Plain (index: 2, duration: 60s) 14:26:26(-0300)

Phase started: CoolDown (index: 3, duration: 30s) 14:26:26(-0300)

--------------------------------------
Metrics for period to: 14:26:20(-0300) (width: 9.984s)
--------------------------------------

http.codes.200: ................................................................ 398
http.request_rate: ............................................................. 40/sec
http.requests: ................................................................. 400
http.response_time:
  min: ......................................................................... 483
  max: ......................................................................... 1709
  median: ...................................................................... 518.1
  p95: ......................................................................... 539.2
  p99: ......................................................................... 561.2
http.responses: ................................................................ 398
vusers.completed: .............................................................. 398
vusers.created: ................................................................ 400
vusers.created_by_name.quote (/quote): ......................................... 400
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 487.5
  max: ......................................................................... 1713.3
  median: ...................................................................... 518.1
  p95: ......................................................................... 550.1
  p99: ......................................................................... 572.6


--------------------------------------
Metrics for period to: 14:26:30(-0300) (width: 9.897s)
--------------------------------------

http.codes.200: ................................................................ 313
http.request_rate: ............................................................. 31/sec
http.requests: ................................................................. 294
http.response_time:
  min: ......................................................................... 482
  max: ......................................................................... 567
  median: ...................................................................... 518.1
  p95: ......................................................................... 539.2
  p99: ......................................................................... 550.1
http.responses: ................................................................ 313
vusers.completed: .............................................................. 313
vusers.created: ................................................................ 294
vusers.created_by_name.quote (/quote): ......................................... 294
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 488
  max: ......................................................................... 591
  median: ...................................................................... 518.1
  p95: ......................................................................... 550.1
  p99: ......................................................................... 561.2


--------------------------------------
Metrics for period to: 14:26:40(-0300) (width: 9.692s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 490
  max: ......................................................................... 1085
  median: ...................................................................... 507.8
  p95: ......................................................................... 528.6
  p99: ......................................................................... 982.6
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.quote (/quote): ......................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 492.3
  max: ......................................................................... 1087.5
  median: ...................................................................... 507.8
  p95: ......................................................................... 539.2
  p99: ......................................................................... 982.6


Phase completed: CoolDown (index: 3, duration: 30s) 14:26:56(-0300)

--------------------------------------
Metrics for period to: 14:26:50(-0300) (width: 9.689s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 489
  max: ......................................................................... 541
  median: ...................................................................... 507.8
  p95: ......................................................................... 528.6
  p99: ......................................................................... 539.2
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.quote (/quote): ......................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 491
  max: ......................................................................... 542.7
  median: ...................................................................... 507.8
  p95: ......................................................................... 528.6
  p99: ......................................................................... 539.2


--------------------------------------
Metrics for period to: 14:27:00(-0300) (width: 7.533s)
--------------------------------------

http.codes.200: ................................................................ 38
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 36
http.response_time:
  min: ......................................................................... 489
  max: ......................................................................... 533
  median: ...................................................................... 497.8
  p95: ......................................................................... 528.6
  p99: ......................................................................... 528.6
http.responses: ................................................................ 38
vusers.completed: .............................................................. 38
vusers.created: ................................................................ 36
vusers.created_by_name.quote (/quote): ......................................... 36
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 493.5
  max: ......................................................................... 554.1
  median: ...................................................................... 507.8
  p95: ......................................................................... 528.6
  p99: ......................................................................... 539.2


All VUs finished. Total time: 2 minutes, 33 seconds

--------------------------------
Summary report @ 14:26:58(-0300)
--------------------------------

http.codes.200: ................................................................ 3387
http.request_rate: ............................................................. 22/sec
http.requests: ................................................................. 3387
http.response_time:
  min: ......................................................................... 480
  max: ......................................................................... 1709
  median: ...................................................................... 518.1
  p95: ......................................................................... 645.6
  p99: ......................................................................... 1043.3
http.responses: ................................................................ 3387
vusers.completed: .............................................................. 3387
vusers.created: ................................................................ 3387
vusers.created_by_name.quote (/quote): ......................................... 3387
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 482.7
  max: ......................................................................... 1713.3
  median: ...................................................................... 528.6
  p95: ......................................................................... 658.6
  p99: ......................................................................... 1043.3